// ডিটেইলস : জাভাস্ক্রিপ্টে পাথ মডিউল হলো একটি কোর মডিউল যা ফাইল পাথের সাথে কাজ করে। এটি বিভিন্ন ফাংশন প্রদান করে যা পাথের বিভিন্ন অংশকে বিশ্লেষণ এবং পরিচালনা করতে সাহায্য করে। পাথ মডিউল ব্যবহার করে আপনি পাথের ডিরেক্টরি নাম, এক্সটেনশন, বেস নাম ইত্যাদি সহজেই পেতে পারেন।

const path = require('path');

const myPath = 'C:/Users/sajed/OneDrive/Desktop/Node-JS/Server & Core Modules/index.js';

console.log(path.dirname(myPath)); // এটি পাথের ডিরেক্টরি অংশকে রিটার্ন করে
console.log(path.extname(myPath)); // এটি পাথের এক্সটেনশন অংশকে রিটার্ন করে
console.log(path.basename(myPath)); // এটি পাথের বেস নামকে রিটার্ন করে, অর্থাৎ ফাইলের নাম এবং এক্সটেনশন সহ
console.log(path.parse(myPath)); // এটি পাথের বিভিন্ন অংশকে একটি অবজেক্ট আকারে রিটার্ন করে, যেমন: root, dir, base, ext, name


// ডিটেইলস : জাভাস্ক্রিপ্টে ওএস মডিউল হলো একটি কোর মডিউল যা অপারেটিং সিস্টেম সম্পর্কিত তথ্য এবং ফাংশন প্রদান করে। এটি ব্যবহার করে আপনি সিস্টেমের প্ল্যাটফর্ম, হোম ডিরেক্টরি, সিপিইউ আর্কিটেকচার ইত্যাদি তথ্য পেতে পারেন। 
const os = require('os');

console.log(os.platform()); // এটি অপারেটিং সিস্টেমের প্ল্যাটফর্মকে রিটার্ন করে, যেমন: 'win32', 'darwin', 'linux' ইত্যাদি 
console.log(os.homedir()); // এটি ব্যবহারকারীর হোম ডিরেক্টরির পাথকে রিটার্ন করে
console.log(os.cpus()); // এটি সিপিইউ সম্পর্কিত তথ্যকে একটি অ্যারে আকারে রিটার্ন করে, যেখানে প্রতিটি অবজেক্টে সিপিইউ এর মডেল, স্পিড ইত্যাদি তথ্য থাকে



const fs = require('fs');

fs.writeFileSync('myfile.txt', 'Hello Programming'); // এটি একটি নতুন ফাইল তৈরি করে এবং তাতে নির্দিষ্ট টেক্সট লিখে
fs.appendFileSync('myfile.txt', ' Welcome to Node.js'); // এটি একটি বিদ্যমান ফাইলের শেষে নির্দিষ্ট টেক্সট যোগ করে



